weitat95/IoTEmbedded/RTOS_TM4C123_LifiTransmitter/main.c
/*
*  main.c
*  This main file is used for my BEng Honours 4th Year Project in The University of Edinburgh
*  - Demonstration of Visible Light Communication -
*  This project builts on a previously developed RTOS in of my classes in University of Texas, At Austin
*  
*  Author: Wei Tat Lee
*  Thesis Supervisor: Dr. Jonathan Terry
*  ----------------------------------------------------------------------------
*  The file used for the class EE445M -
*  EMBEDDED AND REAL-TIME SYSTEMS. EE445M - Spring 2017 - University of Texas
*  at Austin. It runs on LM4F120/TM4C123.
*  It contains user programs, File system, stream data onto disk.
*  ----------------------------------------------------------------------------
*  SOFTWARE DISCLAIMER
*
*  THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
*  OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
*  MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
*  THE AUTHOR(S) SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL,
*  INCIDENTAL, OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
*  ----------------------------------------------------------------------------
*
*  NOTES:
*  - Professor Spring 2017 class: Prof. Jonathan W. Valvano
*  - TA Spring 2017             : Kishore Punniyamurthy
*
*/
//*****************************************************************************
//***************************** Connections ***********************************
/*
// IF YOU ARE USING THE LAUNCHPAD VERSION, PLEASE NOTE THAT PD0 and PB6 ARE INTERNALLY CONNECTED 
// THE DAC uses PD0 and Edge Capture uses PB6 which would cause HARD FAILURE
// EDGE CAPTURE TIMER uses this connection to DEBUG EDGE CAPTURE in particular

******Transmitter******
LED Input - GPIO PF2
******Receiver*********
ADCSampler- GPIO PD2 
or
EDGECAPTURE- GPIO PB6
******ST7735***
VCC 			- 3.3V
GND 			- GND
CS  			- PA3
RESET 		- PA7
A0(DATA)	- PA6
SDA(MOSI)	- PA5
SCK				-PA2
LED				-3.3V
*******SDCARD**********
SDCS      - PB0
SDMOSI		- PA5
SDMISO		- PA4
SDSCK			- PA2
******DAC*******
SSI1Clk (SCLK, pin 4) connected to PD0
SSI1Fss (!CS, pin 2) connected to PD1
SSI1Tx (DIN, pin 3) connected to PD3
******Switch****

*/

//*****************************************************************************

/*
To program the emitter for the LIFI please define emitter below
to program the receiver for the LIFI please define receiver below
*/
#define EMITTER
//#define RECEIVER

//************************ CORE FEATURES *************************************
// Only 2 type of options for the Receiver 
// (1) ADC Sampling - PD2 (Configured Below)
// (2) Edge Input Capture Timer - PB6             **A more stable version**

#ifdef RECEIVER
	#define ADCSAMPLING 0

	#define EDGETIMERMODE 1
		//Edge capture is used instead of using ADC sampling
		#if (EDGETIMERMODE)&&(!AUDIOOUT)
			#define EDGETIMERDEBUG 0 	//using PD0 to debug edge timer,
															//DAC is also using PD0
															//Cannot activate both at the same time
			#define AUTODETECTSPEED 1 //Auto Detect Transmitting Frequency
	#endif


	// Debugging option to test ADC Sampling
	#define BUFFERINPUT 0 //If wants buffer input instead of sampling

	#if ADCSAMPLING

		#define EDGETIMERMODE 0
		#define BUFFERINPUT 0

	#endif

#endif
//************************ EXTRA FEATURES ************************************

#define AUDIOOUT 0 //Outputing audio to output (GPIO PORT TO BE DEFINED)
#define SDCARD 1

#if SDCARD 
#define SDDEBUG 1 //Enable SD Card Debugging 
#endif

#define ARM_ADS //Used for HELIX mp3 Decoder 

#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include "os.h"
#include "adct0atrigger.h"
#include "uart.h"
#include "pll.h"
#include "gpio.h"
#include "ff.h"
#include "efile.h"
#include "eDisk.h"
#include "inc/tm4c123gh6pm.h"

#ifdef RECEIVER
	#include "EdgeCount.h"
	#include "ST7735.h"
	#include "DAC.h"
	#include "LifiReceiver.h"
	#define RECINPUT 5 //Channel 5 PD2 (Channel defined in adct0atrigger.c)
	int oversampling = 1; //Oversampling factor used for ADC Sampling
	#if BUFFERINPUT
		#include "LifiEmitter.h"
	#endif
	#if AUDIOOUT
		#include "mp3/fixpt/mp3dec.h"
		#include "mp3/fixpt/mp3common.h"
	#endif
#endif


#ifdef EMITTER

#include "LifiEmitter.h"

#endif


//#define DEBUG
#define SYMBOLRATE 1000 //1kHz //Default Symbol Rate used for transmitter and (ADC SAMPLING ONLY) RECEIVER


#define TIME_SLICE (2*TIME_1MS)
#define ST7735             
// PORT B - Memory Mapped GPIO
#define PB3       (*((volatile unsigned long *)0x40005020))

// PORT F - Memory Mapped GPIO
#define PF0       (*((volatile uint32_t *)0x40025004))
#define PF1       (*((volatile uint32_t *)0x40025008))
#define PF2       (*((volatile uint32_t *)0x40025010))
#define PF3       (*((volatile uint32_t *)0x40025020))
#define PF4       (*((volatile uint32_t *)0x40025040))

uint32_t NumCreated;   // number of foreground threads created
uint32_t NumSamples;   // incremented every sample
uint32_t DataLost;     // data sent by Producer, but not received by Consumer
uint32_t Idlecount;
uint8_t  Running;      // true while OS is running
uint32_t count1;

//Color Coding for Launchpad LED
#define WHITE PF1=0x02; PF2=0x04; PF3=0x08;
#define RED PF1=0x02; PF2=0; PF3=0;
#define GREEN PF1=0; PF2=0x00; PF3=0x08;
#define BLUE PF1=0; PF2=0x04; PF3=0;
#define YELLOW PF1=0x02; PF2=0x00; PF3=0x08;
#define PURPLE  PF1=0x02; PF2=0x04; PF3=0;
#define CYAN PF1=0; PF2=0x04; PF3=0x08;

#define SPACEFORMATTING UART_OutChar(CR); UART_OutChar(LF);
//********** diskError ********************
// Used for SD Card File System Debugging
char str[50];
void diskError(char* errtype, unsigned long n){
  UART_OutString(errtype);
  sprintf(str," disk error %u",n);
  UART_OutString(str);
  OS_Kill();
}
//******** IdleTask  ***************
// foreground thread, runs when no other work needed
// never blocks, never sleeps, never dies
// inputs:  none
// outputs: none

void IdleTask(void){
  
  while(TRUE){
    //GREEN
    Idlecount++;        // debugging
    //WaitForInterrupt();
  }
}


//*************************************************************************************
//*************************************************************************************
//*****************************RECEIVER************************************************
//*************************************************************************************
//*************************************************************************************
#ifdef RECEIVER
unsigned long fail_counter=0;
unsigned long producer_counter=0;
unsigned long buffer[100];
#if (BUFFERINPUT||EDGETIMERDEBUG)

