weitat95/IoTEmbedded/RTOS_TM4C123_LifiTransmitter/main.c
#define HIGH 4000
#define LOW 100
static const unsigned long sleepFrame[] = {HIGH,HIGH, HIGH,HIGH,HIGH, HIGH,HIGH,HIGH, HIGH,HIGH,HIGH, HIGH,HIGH,HIGH, HIGH,HIGH}; //
static const unsigned long idleFrame[] = {HIGH,LOW, HIGH,LOW,LOW,HIGH, HIGH,LOW,LOW,HIGH, HIGH,LOW,LOW,HIGH, HIGH,LOW,LOW,HIGH, LOW,HIGH}; //0xAA IDLE
static const unsigned long preambleFrame[] = {HIGH,LOW, LOW,HIGH,HIGH,LOW, LOW,HIGH,HIGH,LOW, LOW,HIGH,HIGH,LOW, LOW,HIGH,LOW,HIGH, LOW,HIGH}; //0xD5 SYNC
static const unsigned long startFrame[] = {HIGH,LOW, HIGH,LOW,LOW,HIGH, HIGH,LOW,HIGH,LOW, HIGH,LOW,HIGH,LOW, HIGH,LOW,HIGH,LOW, LOW,HIGH}; //0x02 STX
static const unsigned long endFrame[] = {HIGH,LOW, LOW,HIGH,LOW,HIGH, HIGH,LOW,HIGH,LOW, HIGH,LOW,HIGH,LOW, HIGH,LOW,HIGH,LOW, LOW,HIGH}; //0x03 ETX
unsigned long dataFrame1[] = {HIGH,LOW, LOW,HIGH,HIGH,LOW, HIGH,LOW,HIGH,LOW, HIGH,LOW,HIGH,LOW, LOW,HIGH,HIGH,LOW, LOW,HIGH}; //0x41 'A'
#endif
	

int k=0;
//************************************* Debugging Threads *************************
void producerTask(unsigned long data){
  if(k<100){
    buffer[k]=data;
    k++;
  }
	
}

void resetProducerTask(void){
  k=0;
}

#if BUFFERINPUT

// Helper function
void inputFrameIntoOSFifo(const unsigned long * frame){
	int n=0;
	for(int m=0;m<20*oversampling;m++){
		if(n==20){
			while(1){
				; //n shouldn't be more than frame size
			}
		}
		if(OS_Fifo_Put(frame[n])==0){
			fail_counter++;
		}
		if( (m+1)%oversampling==0 || oversampling==1   ){
			n++;
		}
		producer_counter++;
	}		
}

void changeDataFrame1(char character){
	unsigned long int dataa=0;
	to_manchester(character, &dataa);
	manToAnalogue(&dataa, dataFrame1, HIGH, LOW ,1);
}

// Debugging the receiver functionality with hardcoded values in a buffer
void consumerFromBuffer(){
	
	inputFrameIntoOSFifo(idleFrame);
	inputFrameIntoOSFifo(preambleFrame);
	inputFrameIntoOSFifo(startFrame);
	inputFrameIntoOSFifo(dataFrame1);
	inputFrameIntoOSFifo(dataFrame1);
	inputFrameIntoOSFifo(dataFrame1);
	inputFrameIntoOSFifo(endFrame);
	OS_Kill();
}

#endif
//************************************** Final Threads *****************************

// ****************************************ADC Threads *****************************
#if !EDGETIMERMODE
void producerTaskFifo(unsigned long data){
		if(OS_Fifo_Put(data)==0){
			fail_counter++;
		}
		producer_counter++;
}
void startSampling(void){
	OS_Sleep(5000);
	ADC_Collect(RECINPUT,SYMBOLRATE*oversampling,&producerTaskFifo); //Symboltime== Based on system Clock 80000
	OS_Kill();
}
// ***************************************END ADC THREADS***************************
#elif EDGETIMERMODE
//****************************************EDGE CAPTURE THREADS**********************
#define DEFTIMETHRESH (160000)*75/100 //1kHz **Changing Symbol have to change threshold as well**
uint32_t timeThresh=DEFTIMETHRESH;
int myedge=0;
unsigned long mytime;
int myi=0;
#define BUFFFSIZE 1024
unsigned long bufff[BUFFFSIZE];
//Main task for edge capture on PB6
//1 Rising Edge
//2 Rising Edge Long
//3 Falling Edge
//4 Falling Edge Long
void edgeTask(int edge,unsigned long time){
	uint8_t state;
	myedge=edge;
	mytime=time;
	if(myedge==1){
		if(mytime>timeThresh){
			state=OS_Fifo_Put(2);
		}else{state=OS_Fifo_Put(1);}
	}else if(myedge==-1){
		if(mytime>timeThresh){
			state=OS_Fifo_Put(4);
		}else{state=OS_Fifo_Put(3);}
	}
	if(state==0){
		fail_counter++;
	}else{
		producer_counter++;
	}
	
//To get the time threshold

	if(myi>=BUFFFSIZE){myi=0;}
	bufff[myi]=mytime;
	myi++;
}
#if EDGETIMERDEBUG
void putFrame(const unsigned long * frame){
	for(int i=0;i<20;i++){
		if(frame[i]==HIGH){
			GPIO_PORTD_DATA_R |= 0x01;
			OS_SleepUs(20);
		}else if(frame[i]==LOW){
			GPIO_PORTD_DATA_R &= ~0x01;
			OS_SleepUs(20);
		}
	}
}
//Debugging task to simulate square waves in PB6 by toggling PD0 since they are connected by R9;
void pulsePD0(void){
	int n=0;
	while(n<100){
		putFrame(sleepFrame);
		n++;
	}
	n=0;
	while(n<3){
		putFrame(idleFrame);
		n++;
	}
		putFrame(preambleFrame);
		putFrame(startFrame);
		putFrame(dataFrame1);
		putFrame(dataFrame1);
		putFrame(dataFrame1);
		putFrame(endFrame);
		putFrame(idleFrame);
		OS_Kill();
}
#endif

#endif
//*********************** END EDGE CAPTURE THREADS ********************
int consumerTaskCounter=0;
int bufffi=0;
uint32_t unstableTimeCounter=0;
int consumerBigTimeCounter=0;

//************ Core Threads for Receiver *****************************
void consumerTaskFifo(void){
	while(1){
		consumerTaskCounter++;
		unsigned long data = OS_Fifo_Get();
//********************** EDGE CAPTURE******************************
#if EDGETIMERMODE
		if(data==2 || data==4){
			consumerBigTimeCounter++;
		}
		//Auto Detect FrequencyChange
		if(bufff[bufffi]>=timeThresh*100*125/2/75/100||bufff[bufffi]<=timeThresh*85*100/2/75/100){
			unstableTimeCounter++;
		}else{
			unstableTimeCounter=0;
		}
#if AUTODETECTSPEED
		if(unstableTimeCounter>0x2000){ //Around 1~2 Seconds to trigger frequency change
			uint32_t averageVal=0;
			uint32_t freqDetected=0;
			//Take Average Value of thresh
			if(bufffi<9){
				bufffi=BUFFFSIZE;
			}
			for(int i=0;i<10;i++){
			  averageVal+=bufff[bufffi-i];
			}
			averageVal=averageVal/10;
			//freqDetected=(167894-averageVal*2)*19/150;
			timeThresh=averageVal*2*75/100;

			printf("\n\rDetected Change of frequency: Changed Threshold to=%d\n\r", timeThresh);
			unstableTimeCounter=0;
			bufffi=0;
		}
#endif
		bufffi++;
		if(bufffi>=BUFFFSIZE){bufffi=0;}//Prevent out of bounds

		insertEdgeCapture(data);
#else
//********************** END EDGE CAPTURE ******************************
//********************** ADC SAMPLING     ******************************
		sample_signal_edge(data);
//********************** END ADC SAMPLING ******************************
#endif
	}
}
int wordDetectedTaskCounter=0;
void wordDetectedTask(void){
	while(1){
		wordDetectedTaskCounter++;
		getDataFrame();
	}
}

//************ END Core Threads for Receiver ***************************
#if AUDIOOUT
static HMP3Decoder hMP3Decoder;

