weitat95/IoTEmbedded/RTOS_TM4C123_LifiTransmitter/main.c
void audioOutThread(void){

	OS_Kill();
}
#endif

#endif
//*************************************************************************************
//*************************************************************************************
//*****************************EMITTER*************************************************
//*************************************************************************************
//*************************************************************************************


#ifdef EMITTER

int sendData(char* data){
  return write(data,strlen(data));
}
char comBuffer[32];
void sendPeriodicDataTask(void){
  int n=0;
  int counter=-99;
  while(1){
    while(sendData(comBuffer)!=0){
			strcpy(comBuffer,"1234567890123456789012345678901");
      OS_Sleep(500);
      counter++;
    }
    printf("Data Sent:%u",n);
    SPACEFORMATTING
    n++;
  }
  printf("Data Sending Task Done (sent:%u, Wait Counter:%u)",n,counter);
  SPACEFORMATTING
  OS_Kill();
}
#endif

//************************************** OTHER THREADS ***************************
char string[32];
unsigned long bufferInput[100];

//Globals for File Systems
#if SDCARD
static FATFS g_sFatFs;
FIL Handle,Handle2;
FRESULT fresult;
FILINFO finfo;
unsigned char bufferFile[512];
#endif
//Global for controlling emitter transmitting frequency;
uint8_t freqBuffPtr=0;
static const unsigned long freqBuff[] = {1000,5000,10000,20000,50000};
//************************************** INTERPRETOR (UART) ***********************
void Interpreter(void) {
  char str[32];
  char *token;
  UART_Init();
#ifdef EMITTER  
  initEmitter();
#endif
  UART_OutChar(CR);
  UART_OutChar(LF);
  while(1){
    UART_OutChar('-');
    UART_OutChar('-');
    UART_OutChar('>');
    UART_InString(string,29);
    strcpy(str,string);
    token =strtok(str,"-");
//**************************************** SD CARD DEBUGGING ***************************

#if SDDEBUG
		if(strcmp(token,"SDDEBUGREAD")==0){
			int i;  UINT n;			
			SPACEFORMATTING
			fresult = f_mount(0, &g_sFatFs);
			UART_OutString("Mounted FS\n\r");
			if(fresult) diskError("f_mount",0);
			fresult = f_stat("file5.txt",&finfo);
			if(fresult) diskError("f_stat",0);
			
			// assumes there is a short text file named file5.txt
			fresult = f_open(&Handle,"file5.txt", FA_READ);
			if(fresult) diskError("f_open",0);
			
			UART_OutString("Opened file5.txt\n\r");
			i=0;
			UART_OutString("Start Reading..\n\r");
			do{
				fresult = f_read(&Handle,&bufferFile[i],1,&n);
				if(fresult) diskError("f_read",0);
				i++;
			} while((n==1)&&(i<511));
			bufferFile[i] = 0; // null termination
			UART_OutString("Done Reading into Buffer\n\r");
			fresult = f_close(&Handle);
			if(fresult) diskError("f_close",0);
			UART_OutString("File Closed\n\r");
			fresult = f_mount(0,0); //Unmount
			if(fresult) diskError("f_unmount",0);
			UART_OutString("Unmount Fs\n\r");
			UART_OutString("Done ReadTest Task\n\r");
			continue;
		}
		if(strcmp(token,"SDDEBUGWRITE")==0){
			SPACEFORMATTING
			 int i;  UINT n; char letter;
			fresult = f_mount(0, &g_sFatFs);
			printf("Mounted FS\n\r");
			if(fresult) diskError("f_mount",0);
			fresult = f_open(&Handle,"file6.txt",FA_CREATE_ALWAYS|FA_WRITE);
			if(fresult) diskError("f_open",0);
			printf("Opened (Created) file6.txt\n\r");
			i=0;
			 do{
				if((i%10) == 9) letter = 13;
				else if ((i%10) == 10) letter = 10;
				else letter = (i%10)+'a';
				fresult = f_write(&Handle,&letter,1,&n);
				
				if(fresult) diskError("f_write",0);
				i++;
			} while((n==1)&&(i<511));
			 
			fresult = f_close(&Handle);
			if(fresult) diskError("f_close",0);
			UART_OutString("File Closed\n\r");
			fresult = f_mount(0,0); //Unmount
			if(fresult) diskError("f_unmount",0);
			UART_OutString("Unmount Fs\n\r");
			UART_OutString("Done ReadTest Task\n\r");
			
			continue;
		}
		
		if(strcmp(token,"SDFILESTAT")==0){
			SPACEFORMATTING
			token=strtok(NULL,"-");
			fresult = f_mount(0, &g_sFatFs);
			printf("Mounted FS\n\r");
			if(fresult) diskError("f_mount",0);
			fresult = f_stat(token,&finfo);
			if(fresult) diskError("f_stat",0);
			printf("FileName:%s, FileSize: %d Bytes\n\r",finfo.fname,finfo.fsize);
			fresult = f_mount(0,0); //Unmount
			if(fresult) diskError("f_unmount",0);
			printf("Un-mounted FS\n\r");
			continue;
		}
		if(strcmp(token,"SDFILEREADTOWRITE")==0){
			SPACEFORMATTING
			char fileName[]="male.mp3";
			char file2Name[]="copy.mp3";
			int i;  UINT n; char letter; int fileSize;
			fresult = f_mount(0, &g_sFatFs);
			printf("Mounted FS\n\r");
			if(fresult) diskError("f_mount",0);
			fresult = f_open(&Handle2,fileName,FA_READ);
			if(fresult) diskError("f_open",0);
			printf("Opened %s\n\r",fileName);
			fresult = f_stat(fileName,&finfo);
			fileSize=finfo.fsize;
			if(fresult) diskError("f_stat",0);
			printf("Checked %s stats:%d Bytes\n\r",fileName,fileSize);
			fresult = f_open(&Handle,file2Name,FA_CREATE_ALWAYS|FA_WRITE);
			if(fresult) diskError("f_open",0);
			printf("Opened (Created) %s\n\r",file2Name);
			i=0;
			
			do{
				if(fileSize<512){
					fresult = f_read(&Handle2,bufferFile,fileSize,&n);
					if(fresult) diskError("f_read",0);
					fresult = f_write(&Handle,bufferFile,fileSize,&n);
					if(fresult) diskError("f_write",0);
				}else{
					fresult = f_read(&Handle2,bufferFile,512,&n);
					if(fresult) diskError("f_read",0);
				
					fresult = f_write(&Handle,bufferFile,512,&n);
					if(fresult) diskError("f_write",0);
				}
				i++;
				fileSize-=512;
					
			}while(fileSize>0);
			 
			fresult = f_close(&Handle);
			if(fresult) diskError("f_close",0);
			fresult = f_close(&Handle2);
			if(fresult) diskError("f_close",0);
			UART_OutString("File Closed\n\r");

			fresult = f_stat(file2Name,&finfo);
			fileSize=finfo.fsize;
			if(fresult) diskError("f_stat",0);
			printf("Checked %s stats:%d Bytes\n\r",file2Name,fileSize);
			fresult = f_mount(0,0); //Unmount
			if(fresult) diskError("f_unmount",0);
			UART_OutString("Unmount Fs\n\r");
			UART_OutString("Done FILEREADTOWRITE\n\r");
			
			continue;			
		}
#endif
//************************** AUDIO OUT (DAC)**************************************
#if AUDIOOUT
			if(strcmp(token,"AUDIOTEST")==0){
				SPACEFORMATTING
				NumCreated += OS_AddThread(&audioOutThread,128,2);

				continue;
			}
#endif
		
//**************************************** RECEIVER ************************************
#ifdef RECEIVER
    if(strcmp(token,"ADCIN")==0){
      SPACEFORMATTING
      resetProducerTask();
      ADC_Collect(RECINPUT,SYMBOLRATE*oversampling,&producerTask); //Symboltime== Based on system Clock 80000
			while(k<100){
				;
			}
			for(int i=0;i<100;i++){
				printf("\n\r%d",buffer[i]);
			}
			continue;
    }
		if(strcmp(token,"ADC2IN")==0){
      SPACEFORMATTING
      resetProducerTask();
      ADC_Collect(RECINPUT,SYMBOLRATE,&producerTask); //Symboltime== Based on system Clock 80000
			continue;
		}
#if BUFFERINPUT
		if(strcmp(token,"INPUTFROMBUFFER")==0){
      SPACEFORMATTING
			NumCreated += OS_AddThread(&consumerFromBuffer,128,4);
			continue;
		}
		
		if(strcmp(token,"CONVERT")==0){
			unsigned long int dataa=0;
			SPACEFORMATTING
			token=strtok(NULL,"-");
			to_manchester(token[0], &dataa);
			manToAnalogue(&dataa, bufferInput, 1, 0 ,1);
			for(int i=0;i<20;i++){
				if(bufferInput[i]==1){
					UART_OutChar('1');
				}else {
					UART_OutChar('0');
				}
				
