weitat95/IoTEmbedded/RTOS_TM4C123_LifiTransmitter/main.c
				UART_OutChar(' ');
			  if(i==1 || i==5 || i==9 ||i==13 ||i==17){
					UART_OutChar(',');
				}
			}
			continue;
		}
		if(strcmp(token,"CHANGEBUFFER")==0){
			SPACEFORMATTING
			token=strtok(NULL,"-");
			changeDataFrame1(token[0]);
			continue;
		}
#endif
		
#if EDGETIMERMODE
		if(strcmp(token, "THRESHUP")==0){
			SPACEFORMATTING
			timeThresh+=timeThresh*10/100;
			printf("timeThresh: %d\n\r",timeThresh);
			continue;
		}
		if(strcmp(token, "THRESHDOWN")==0){
			SPACEFORMATTING
			timeThresh-=timeThresh*10/100;
			printf("timeThresh: %d\n\r",timeThresh);
			continue;
		}
		if(strcmp(token, "THRESHDEBUG")==0){
			SPACEFORMATTING
			timeThresh=1000;
			printf("timeThresh: %d\n\r",timeThresh);
			continue;
		}
		
		if(strcmp(token, "THRESHSET")==0){
			SPACEFORMATTING
			token=strtok(NULL,"-");
			if(strcmp(token, "1000")==0){
				timeThresh=100000;
				printf("Frequency: 1kHz,Thres: %d",timeThresh);
			}
			else if(strcmp(token,"10000")==0){
				timeThresh=10000;
				printf("Frequency: 10kHz,Thres: %d",timeThresh);
			}else if(strcmp(token,"20000")==0){
				timeThresh=6000;
				printf("Frequency: 20kHz,Thres: %d",timeThresh);
			}
			printf("timeThresh: %d\n\r",timeThresh);
			continue;
		}
#if EDGETIMERDEBUG
		if(strcmp(token,"SIMULATEEDGE")==0){
			SPACEFORMATTING
			NumCreated += OS_AddThread(&pulsePD0,128,2);
			continue;
		}
#endif
#endif
		
		
#endif
		
		
//**************************************** TRANSMITTER ************************************
void emit_half_bit(void);

#ifdef EMITTER
    if(strcmp(token,"SEND")==0){
			SPACEFORMATTING
#ifdef DEBUG
			resetCounter();
#endif
      token=strtok(NULL,"-");

      OS_StartCritical();
      int ret=write(token,strlen(token));
      OS_EndCritical();
      if(ret==0)  UART_OutString("Data sent\n\r");
      else UART_OutString("Data not sent\n\r");
			continue;
    }
    if(strcmp(token,"SENDCONT")==0){ 
			SPACEFORMATTING
      token=strtok(NULL,"-");
      strcpy(comBuffer,token);
      SPACEFORMATTING
      NumCreated += OS_AddThread(&sendPeriodicDataTask,128,4);
			continue;
    }
	if(strcmp(token,"CHANGEFREQ")==0){
			SPACEFORMATTING
			OS_StartCritical();
			OS_DisablePeriodicThread();
			resetEmitterState();
			OS_AddPeriodicThread(&emit_half_bit,TIME_1S/freqBuff[freqBuffPtr],3);
			OS_EndCritical();
			printf("Transmitting Frequency: %d\n\r",freqBuff[freqBuffPtr]);
			freqBuffPtr++;
			if(freqBuffPtr>=5){
				freqBuffPtr=0;
			}
			continue;
		}
#endif

    UART_OutChar(CR);
    UART_OutChar(LF);
  }
}


//*******************************************END Interpretor ****************************
  
//******************************************* MAIN FUNCTION ******************************

int main(void){
  
  OS_Init();        // OS Initialization
  GPIO_PortF_Init();

  Running    = 0;        // Log not running
  DataLost   = 0;        // lost data between producer and consumer
  NumSamples = 0;
  Idlecount  = 0;
  count1=0;
  NumCreated = 0;
#if SDCARD
	OS_AddPeriodicThread2(&disk_timerproc,10*TIME_1MS,0);   // time out routines for disk
#endif
#ifdef EMITTER
  OS_AddPeriodicThread(&emit_half_bit,TIME_1S/SYMBOLRATE,3);
	NumCreated += OS_AddThread(&Interpreter,128,4);
	
#endif
	
	

#ifdef RECEIVER
	OS_Fifo_Init(2048);
	ST7735_InitR(INITR_REDTAB);

#if EDGETIMERMODE
	oversampling=1;
#endif

	initLifiReceiver(oversampling);
	NumCreated += OS_AddThread(&Interpreter,128,5);						
	NumCreated += OS_AddThread(&consumerTaskFifo,128,4);
	NumCreated += OS_AddThread(&wordDetectedTask,128,3);
#if AUDIOOUT
	NumCreated += OS_AddThread(&audioOutThread,128,5);
#endif
	#if ((!BUFFERINPUT)&&(!EDGETIMERMODE))
		NumCreated += OS_AddThread(&startSampling,128,2);
	#endif

	#if EDGETIMERMODE
		EdgeTimer_Init(&edgeTask);
		#if EDGETIMERDEBUG	
			//Activate Port D for simulating squarewaves to test edge capture to PB6
			SYSCTL_RCGCGPIO_R |= 0x08; // activate Port D
			while((SYSCTL_PRGPIO_R&0x08) == 0){};// allow time to finish activating
			GPIO_PORTD_DIR_R |= 0x01;  // make PD0 out
			GPIO_PORTD_AFSEL_R &= ~0x01;// disable alt funct on PD0
			GPIO_PORTD_DEN_R |= 0x01;  // enable digital I/O on PD0
															 // configure PD0 as GPIO
			GPIO_PORTD_PCTL_R = (GPIO_PORTD_PCTL_R&0xFFFFFFF0)+0x00000000;
			GPIO_PORTD_AMSEL_R &= ~0x01;// disable analog functionality on PD0
			GPIO_PORTD_DATA_R = 0;
		#endif
	#endif
#endif

  NumCreated += OS_AddThread(&IdleTask,128,6);  // runs when nothing useful to do

  OS_Launch(TIME_SLICE); // doesn't return, interrupts enabled in here

  return -1;             // this never executes
}
